#+title: Function
#+author: faultypointer
#+date: <2025-03-28 Fri>


*** Optional Parameters
#+begin_src lisp :exports both 
(defun foo (a b &optional (c 5) d) (list a b c d))

(format nil "(foo 1 2) ==> ~a~%~
(foo 1 2 3) ==> ~a~%~
(foo 1 2 3 4) ==> ~a"
        (foo 1 2)
        (foo 1 2 3)
        (foo 1 2 3 4))
#+end_src

#+RESULTS:
: (foo 1 2) ==> (1 2 5 NIL)
: (foo 1 2 3) ==> (1 2 3 NIL)
: (foo 1 2 3 4) ==> (1 2 3 4)

It is an error to pass less than 2 or more than 4 arguments.

*default parameter using previous parameters from the list* 
#+begin_src lisp
(defun make-rect (width &optional (height width)))
#+end_src

here when height argument is not supplied, it takes the value supplied to width thus making a square.

*did the caller pass the argument or is it a default*
well you can find out easily
#+begin_src lisp
(defun foo (a b &optional (c 3 c-supplied-p))
  (list a b c c-supplied-p))

(format nil "(foo 1 2) ==> ~a~%~
(foo 1 2 3) ==> ~a~%~
(foo 1 2 3 4) ==> ~a"
        (foo 1 2)
        (foo 1 2 3)
        (foo 1 2 4))

#+end_src

#+RESULTS:
: (foo 1 2) ==> (1 2 3 NIL)
: (foo 1 2 3) ==> (1 2 3 T)
: (foo 1 2 3 4) ==> (1 2 4 T)

* Higher Order Functions
functions are just another kind of objects.
*what does ~defun~ really do?*
it creates a new function object and gives it a name.
#+begin_src lisp :exports both
(format nil "~a" (macroexpand-1 '(defun foo (x y) (list (x y)))))
#+end_src

#+RESULTS:
: (PROGN
:  (EVAL-WHEN (COMPILE-TOPLEVEL) (%COMPILER-DEFUN 'FOO T NIL NIL))
:  (%DEFUN 'FOO
:          (NAMED-LAMBDA FOO
:              (X Y)
:            (BLOCK FOO (LIST (X Y))))))

i don't understand the top three lines entirely. the bottom three i can guess.
the last line describes a block with name foo. the two before that seems to be defining a named lambda function

** Some Freaky stuff: FUNCALL and APPLY
#+begin_src lisp
(defun plot (fn min max step)
    (with-output-to-string (*standard-output*)
      (loop for i from min to max by step do
        (loop repeat (funcall fn i) do (format t "*"))
        (format t "~%"))))

(plot #'exp 0 4 1/2)
#+end_src

#+RESULTS:
: *
: **
: ***
: *****
: ********
: *************
: *********************
: **********************************
: *******************************************************

the ~#'~ stuff is a shorthand for special operator ~FUNCTION~ that gets the function object with the given name.

the ~(funcall fn arguments*)~ calls function named ~fn~ with the arguments.


if you think thats cool, wait till you hear about ~APPLY~. it accepts function object as a first argument and list as a second argument. it then applies the function to the values in the list.

so you could do something like this ~(apply #'plot plot-data)~ where plot-data is a list containing the function min max and steps

so even something like this ~(apply #'plot #'exp plot-data)~ where plot data only contained min max and step.

